#include <stdio.h>
#include <locale.h>

/* Домашнее задание №9, занятие от 31.01.2024
Задача 2 (F5 ДЗ 3).

Максимум в массиве

Написать функцию и программу, демонстрирующую работу данной функции, которая находит
максимальный элемент в массиве.
Прототип функции: int find_max_array(int size, int a[])

Данные на входе: Массив состоящий из целых чисел. Первый аргумент, размер массива,
второй аргумент адрес нулевого элемента.
Данные на выходе: Одно целое число

Пример №1
Данные на входе: 773 307 371 548 531 765 402 27 573 591 217 859 662 493 173 174 125
591 324 231 130 394 573 65 570 258 343 3 586 14 785 296 140 726 598 262 807 794 510 465 66
895 182 218 302 34 205 252 687 660 952 737 2 32 310 680 36 139 346 139 489 217 767 544 158
774 883 154 802 136 569 377 867 423 224 176 118 660 513 734 45 978 983 749 909 601 270 147
433 737 789 304 842 769 815 503 190 399 3.
Данные на выходе: 983

*/

#define size_buffer 100

int find_max_element(int size, int a[])
{
    int max_element = a[0];

    for (int i = 0; i < size; i++)
    {
        if (max_element < a[i])
            max_element = a[i];
    }

    return max_element;
}

int main(void)
{
    setlocale (LC_ALL, "Rus");

    int arr[size_buffer] = {773, 307, 371, 548, 531, 765, 402,  27, 573, 591,
                            217, 859, 662, 493, 173, 174, 125, 591, 324, 231,
                            130, 394, 573,  65, 570, 258, 343,   3, 586,  14,
                            785, 296, 140, 726, 598, 262, 807, 794, 510, 465,
                             66, 895, 182, 218, 302,  34, 205, 252, 687, 660,
                            952, 737,   2,  32, 310, 680,  36, 139, 346, 139,
                            489, 217, 767, 544, 158, 774, 883, 154, 802, 136,
                            569, 377, 867, 423, 224, 176, 118, 660, 513, 734,
                             45, 978, 983, 749, 909, 601, 270, 147, 433, 737,
                            789, 304, 842, 769, 815, 503, 190, 399,   3};

    printf("Макс. элемент в массиве: %d", find_max_element(size_buffer, arr));
    printf("\n");

    return 0;
}
